def hello():
    text = """<b>🪬 AVE, Ретрохантер!</b>


⚙️ Единственный невозобновляемый ресурс - <i>это время</i>. Набивание транзакций не стоит твоего времени, поэтому настал час <b>АВТОМАТИЗАЦИИ</b>

🖥 <b>Spartex Labs</b> - ваш верный софт-сервис, наполненный скриптами для наших любимых веб3 проектов, от которых нам нужны только <b>MONEY</b>!

<i>ВАШ ПЛАН ДЕЙСТВИЙ</i>:
<blockquote>🔺 Выбираете веб3 проект и функцию
🔺 Отправляете приватники и прокси в указанном формате
🔺 Настраиваете необходимую задержку между действиями
🔻 Получаете готовые кошельки и кучу свободного ВРЕМЕНИ
</blockquote>
<b>Не знаете какой проект отрабатывать? Не разобрались в функциях? Не придумали куда деть освободившееся время?!
Переходи в @spartexlabs и @spartexcap - поглащай выжимки и ресерчи, чтобы стать альфой рынка!</b>"""

    return text


def profile(message):
    profile_text = f"Ваш профиль, альфа ретрохантер! 🧑‍🦽\n\n" \
                   f"🧿  ID: {message.from_user.id}\n" \
                   f"🧢  nick: {message.from_user.full_name[:32]}\n" \
                   f"🩻  username: {message.from_user.username}\n" \
                   f"🪙  Баланс: 0$\n" \
                   f"Выберите нужный пункт кнопками."
    return profile_text


def base_txt():
    text = """<blockquote>Base</blockquote>
<tg-spoiler>Ресерч и гайды по проектам можно 
найти в закрепе @spartexcap</tg-spoiler>

<b>Минимальный баланс на кошельках для запуска 0.005 ETH</b>
Цена указана за прогон одного кошелька!

<b>1. BRIDGE</b>

Доступные исходящие сети: 
<u>Arbitrum, Base, Optimism, Ethereum Mainet</u>
Входящая сеть: Base

<i>Цена за один прогон: $0.29 USD</i>

<b>2. SWAPS</b>

От 2 до 4 свапов на рандомных свапалках (odos, sushiswap, uniswap)
Берёт 75-85% баланса, подходит для набивки объёма

<i>Цена за один прогон: $0.09 USD</i>

<b>3. PROTOCOLS</b>

Набивает количество задетых уникальных смарт-контрактов
Количество рандомное от 5 до 15
<tg-spoiler>Новый запуск может активировать, то что было пропущено</tg-spoiler>

<i>Цена за один прогон: $0.29 USD</i>

<b>4. COLLECTOR</b>

Собирает все токены в ETH путём свапа
Полезно выполнять после других функций

<i>Цена за один прогон: $0.04 USD</i>

<b>5. THE ROUTE FOR ACTION</b>

Уникальных маршрут с рандомизацией
Заденет разные протоколы и активности

<u>Лучший вариант для набивки 
Активных дней/недель/месяцев</u>

<i>Цена за один прогон: $0.29 USD</i>
"""

    return text


def scroll_txt():
    text = """<blockquote>Scroll</blockquote>
<tg-spoiler>Ресерч и гайды по проектам можно 
найти в закрепе @spartexcap<t/g-spoiler>

<b>Минимальный баланс на кошельках для запуска 0.005 ETH<b>
Цена указана за прогон одного кошелька!

<b>1. BRIDGE</b>

Доступные исходящие сети: 
<u>Arbitrum, Base, Optimism, Ethereum Mainet</u>
Входящая сеть: Scroll

<i>Цена за один прогон: $0.39 USD</i>

<b>2. SWAPS</b>

От 2 до 4 свапов на рандомных свапалках (izumi, syncswap, ambient)
Берёт 75-85% баланса, подходит для набивки объёма

<i>Цена за один прогон: $0.29 USD</i>

<b>3. PROTOCOLS</b>

Набивает количество задетых уникальных смарт-контрактов
Количество рандомное от 5 до 15
<tg-spoiler>Новый запуск может активировать, то что было пропущенно</tg-spoiler>

<i>Цена за один прогон: $0.29 USD</i>

<b>4. COLLECTOR</b>

Собирает все токены в ETH путём свапа
Полезно выполнять после других функций

<i>Цена за один прогон: $0.19 USD</i>

<b>5. THE ROUTE FOR ACTION</b>

Уникальных маршрут с рандомизацией
Заденет разные протоколы и активности

<u>Лучший вариант для набивки 
Активных дней/недель/месяцев<u>

<i>Цена за один прогон: $0.49 USD</i>
"""

    return text


def linea_txt():
    text = """<blockquote>Linea</blockquote>
<tg-spoiler>Ресерч и гайды по проектам можно 
найти в закрепе @spartexcap</tg-spoiler>

<b>Минимальный баланс на кошельках для запуска 0.005 ETH</b>
Цена указана за прогон одного кошелька!

<b>1. BRIDGE</b>

Доступные исходящие сети: 
<u>Arbitrum, Base, Optimism, Ethereum Mainet, Scroll</u>
Входящая сеть: Linea

<i>Цена за один прогон: $0.09 USD</i>

<b>2. SWAPS</b>

От 2 до 4 свапов на рандомных свапалках (syncswap, pancake, woofi)
Берёт 75-85% баланса, подходит для набивки объёма

<i>Цена за один прогон: $0.29 USD</i>

<b>3. PROTOCOLS</b>

Набивает количество задетых уникальных смарт-контрактов
Количество рандомное от 5 до 15
<tg-spoiler>Новый запуск может активировать, то что было пропущенно</tg-spoiler>

<i>Цена за один прогон: $0.29 USD</i>

<b>4. COLLECTOR</b>

Собирает все токены в ETH путём свапа
Полезно выполнять после других функций

<i>Цена за один прогон: $0.19 USD</i>

<b>5. THE ROUTE FOR ACTION</b>

Уникальных маршрут с рандомизацией
Заденет разные протоколы и активности

<u>Лучший вариант для набивки 
Активных дней/недель/месяцев</u>

<i>Цена за один прогон: $0.49 USD</i>
"""

    return text


def zora_txt():
    text = """<blockquote>Zora</blockquote>
<tg-spoiler>Ресерч и гайды по проектам можно 
найти в закрепе @spartexcap</tg-spoiler>

<b>Минимальный баланс на кошельках для запуска 0.005 ETH</b>
Цена указана за прогон одного кошелька!


<b>1. BRIDGE</b>

Доступные исходящие сети: 
<u>Arbitrum, Base, Optimism, Ethereum Mainet</u>
Входящая сеть: Zora (если через эфир то будет офф бридж)

<i>Цена за один прогон: $0.29 USD</i>



<b>2. Минт NFT.</b>

Минт проходит в сети Zora на оффициальной площадке
После выбора этой функции вам необходимо прислать
URL АДРЕС нфт на Zora.co
<tg-spoiler>БЕЗ РЕФ ССЫЛОК</tg-spoiler>

<i>Цена за один прогон: $0.15 USD</i>



<b>3. Легкие транзы. </b>

А именно: 
[+]  MINT For MINT.FUN 
[+]  Deploy Smart Contract  
[+]  Buy Token. $ENJOY,  $IMAGINE 

<i>Цена за один прогон: $0.09 USD</i>
"""

    return text


def hyperlane_txt():
    text = """<blockquote>Hyperlane</blockquote>
<tg-spoiler>Ресерч и гайды по проектам можно 
найти в закрепе @spartexcap</tg-spoiler>

<b>Минимальный баланс на кошельках для запуска 0.005 ETH</b>
ETH должен лежать в исходящей сети
Доступные сети: Arbitrum, Optimism, Base, Polygon, Scroll, Linea, BSC

1. <b>MINT AND BRIDGE NFT ON Merkly</b>

<b>Минтит нфт на меркли и отравляет в входящую сеть</b>

<i>Цена за один прогон: $0.09 USD</i>

2. <b>MINT AND BRIDGE TOKENS ON Merkly</b>

Минтит токен от меркли и отправляет в входящую сеть.

<i>Цена за один прогон: $0.09 USD</i>
"""

    return text


def checker_txt():
    text = """Чекер:
Получение балансов на кошельках в нативе и токенах бесплатно!
"""

    return text
